backend/testing/k6/hasil-loadtest.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m01.0s/1m0s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m02.0s/1m0s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m03.0s/1m0s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m04.0s/1m0s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m05.0s/1m0s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m06.0s/1m0s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m07.0s/1m0s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m08.0s/1m0s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m09.0s/1m0s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m10.0s/1m0s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m11.0s/1m0s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m12.0s/1m0s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m13.0s/1m0s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m14.0s/1m0s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m15.0s/1m0s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m17.0s/1m0s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m18.0s/1m0s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m19.0s/1m0s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m20.0s/1m0s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m21.0s/1m0s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m22.0s/1m0s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m23.0s/1m0s

running (0m24.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m24.0s/1m0s

running (0m25.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m25.0s/1m0s

running (0m26.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m26.0s/1m0s

running (0m27.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m27.0s/1m0s

running (0m28.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m28.0s/1m0s

running (0m29.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m29.0s/1m0s

running (0m30.0s), 50/50 VUs, 1450 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m30.0s/1m0s

running (0m31.0s), 50/50 VUs, 1500 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  0m31.0s/1m0s

running (0m32.0s), 50/50 VUs, 1550 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m32.0s/1m0s

running (0m33.0s), 50/50 VUs, 1600 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m33.0s/1m0s

running (0m34.0s), 50/50 VUs, 1650 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  0m34.0s/1m0s

running (0m35.0s), 50/50 VUs, 1700 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m35.0s/1m0s

running (0m36.0s), 50/50 VUs, 1750 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m36.0s/1m0s

running (0m37.0s), 50/50 VUs, 1800 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  0m37.0s/1m0s

running (0m38.0s), 50/50 VUs, 1850 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m38.0s/1m0s

running (0m39.0s), 50/50 VUs, 1900 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m39.0s/1m0s

running (0m40.0s), 50/50 VUs, 1950 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  0m40.0s/1m0s

running (0m41.0s), 50/50 VUs, 2000 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m41.0s/1m0s

running (0m42.0s), 50/50 VUs, 2050 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m42.0s/1m0s

running (0m43.0s), 50/50 VUs, 2100 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  0m43.0s/1m0s

running (0m44.0s), 50/50 VUs, 2150 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m44.0s/1m0s

running (0m45.0s), 50/50 VUs, 2200 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m45.0s/1m0s

running (0m46.0s), 50/50 VUs, 2250 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  0m46.0s/1m0s

running (0m47.0s), 50/50 VUs, 2300 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m47.0s/1m0s

running (0m48.0s), 50/50 VUs, 2350 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m48.0s/1m0s

running (0m49.0s), 50/50 VUs, 2400 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  0m49.0s/1m0s

running (0m50.0s), 50/50 VUs, 2450 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m50.0s/1m0s

running (0m51.0s), 50/50 VUs, 2500 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m51.0s/1m0s

running (0m52.0s), 50/50 VUs, 2550 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  0m52.0s/1m0s

running (0m53.0s), 50/50 VUs, 2600 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m53.0s/1m0s

running (0m54.0s), 50/50 VUs, 2650 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m54.0s/1m0s

running (0m55.0s), 50/50 VUs, 2700 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  0m55.0s/1m0s

running (0m56.0s), 50/50 VUs, 2750 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m56.0s/1m0s

running (0m57.0s), 50/50 VUs, 2800 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m57.0s/1m0s

running (0m58.0s), 50/50 VUs, 2850 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  0m58.0s/1m0s

running (0m59.0s), 50/50 VUs, 2900 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m59.0s/1m0s

running (1m00.0s), 50/50 VUs, 2950 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m00.0s/1m0s


hasil-loadtest.txt
  Γûê TOTAL RESULTS 

    checks_total.......: 3000    49.29742/s
    checks_succeeded...: 100.00% 3000 out of 3000
    checks_failed......: 0.00%   0 out of 3000

    Γ£ô status is 200

    HTTP
    http_req_duration..............: avg=10.17ms min=516.1┬╡s med=3.93ms max=212.05ms p(90)=9.86ms p(95)=27.99ms
      { expected_response:true }...: avg=10.17ms min=516.1┬╡s med=3.93ms max=212.05ms p(90)=9.86ms p(95)=27.99ms
    http_req_failed................: 0.00%  0 out of 3000
    http_reqs......................: 3000   49.29742/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1s      med=1s     max=1.22s    p(90)=1.01s  p(95)=1.02s  
    iterations.....................: 3000   49.29742/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 27 MB  440 kB/s
    data_sent......................: 255 kB 4.2 kB/s

running (1m00.9s), 00/50 VUs, 3000 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 50 VUs  1m0s